Revit 2027 API
BuiltInFailures.GeometryFailures.SuccessToConvertLine Property
 Success to convert lines
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SuccessToConvertLine { get; }
Public Shared ReadOnly Property SuccessToConvertLine As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SuccessToConvertLine {
	FailureDefinitionId^ get ();
}
static member SuccessToConvertLine : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GeometryFailures Class
Autodesk.Revit.DB Namespace